# Taps
tap "chef/chef"
tap "github/gh"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "instrumenta/instrumenta"
tap "versent/taps"

# Brew Formula (CLI tools)
brew "asciinema"
brew "awscli"
brew "bash"
brew "bash-completion@2"
brew "darksky-weather"
brew "ffsend"
brew "fish"
brew "git"
brew "github/gh/gh"
brew "go"
brew "googler"
brew "heroku/brew/heroku"
brew "httpie"
brew "hub"
brew "instrumenta/instrumenta/kubeval"
brew "jq"
brew "jsonnet"
brew "lynx"
brew "mas"
brew "minikube"
brew "neofetch"
brew "nmap"
brew "nnn"
brew "node"
brew "pandoc"
brew "python"
brew "ranger"
brew "rbenv"
brew "ripgrep"
brew "rtv"
brew "ruby-build"
brew "sqlite"
brew "task"
brew "tmux"
brew "transmission-cli"
brew "tree"
brew "tty-clock"
brew "versent/taps/saml2aws"
brew "vim"
brew "wget"
brew "yarn"

# Casks (.app programs)
cask "atom"
cask "background-music"
cask "calibre"
cask "chefdk"
cask "db-browser-for-sqlite"
cask "docker"
cask "firefox"
cask "firefox-developer-edition"
cask "firefox-nightly"
cask "google-chrome"
cask "google-chrome-canary"
cask "google-cloud-sdk"
cask "keybase"
cask "mark-text"
cask "muzzle"
cask "notable"
cask "postman"
cask "rectangle"
cask "transmission"
cask "typora"
cask "visual-studio-code"
cask "zoomus"
